# AddElementIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandler..::..AddElementIds Method
StructuralConnectionHandler Class See Also
---
Adds element ids to the connection. All element ids in an array should be of applicable category.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void AddElementIds(
	IList<ElementId> elemIds
)
```

Visual Basic
---
```text
Public Sub AddElementIds ( _
	elemIds As IList(Of ElementId) _
)
```

Visual C++
---
```text
public:
void AddElementIds(
	IList<ElementId^>^ elemIds
)
```

# ### Parameters
elemIds
    Type: System.Collections.Generic..::..IList<(Of <(<'ElementId>)>)> The ElementIdArr containing ids of elements to be added.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | One or more element ids was not permitted to be add to the connection. Elements should be of applicable category. -or- One or more element ids was not permitted to be added to the connection. Elements should not be duplicated. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace